## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.archive_form_templates will be created
  + resource "aws_lambda_function" "archive_form_templates" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/archive_form_templates_main.zip"
      + function_name                  = "ArchiveFormTemplates"
      + handler                        = "archiver.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "hnxlZxxv2yMpRiU2heu1IEjtP7oUET2AuVuU080nMrY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_ARN"      = "arn:aws:rds:ca-central-1:687401027353:cluster:forms-staging-db-cluster"
              + "DB_NAME"     = "forms"
              + "DB_SECRET"   = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:database-secret-vHJuTe"
              + "ENVIRONMENT" = "staging"
              + "REGION"      = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:95",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:102",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.reliability_lib must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:95" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-08-10T14:27:11.073+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:95" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "zSFtN06jdbwHN1ZueIPDZV3NyVFx1WTn4VZG3Q/9niU=" -> "vqqahy6LzgbixH1QzjR7zU1l9CBcTkGrDRo1QRZEmz0=" # forces replacement
      ~ source_code_size            = 7950 -> (known after apply)
      ~ version                     = "95" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:102" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-08-10T14:27:17.415+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:102" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "9bH3BBuPipYi/J9QOHI1Rcb0nX3I2cw5jTsIdzn95b8=" -> "n6YnGHcT4lwHeDmlni59FNqBB15qv7esuvGUw62M7y8=" # forces replacement
      ~ source_code_size            = 8747790 -> (known after apply)
      ~ version                     = "102" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_archive_form_templates_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_archive_form_templates_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ArchiveFormTemplates"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-4am"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 4 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_role.s3_scan_object"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
